CaseLabGreenatom/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказаПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/InformationRegisters/СтраховойЗапас/СтраховойЗапас.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтраховойЗапас</name>
  <resources>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CaseLabGreenatom/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

CaseLabGreenatom/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаБезНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.РеквизитыОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CaseLabGreenatom/src/Documents/ЗаказПоставщику/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	
	ОчиститьСообщения();
	
	АктуализацияСтатусовЗаказовВызовСервера.АктуализироватьСтатусы();
	
	Элементы.Список.Обновить();
						
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПоОстаткам(Команда)
		
	НовыйЗаказ = СоздатьЗаказПоОстаткамНаСервере();
	
	ПараметрыФормы = Новый Структура("Ключ", НовыйЗаказ);
    ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьЗаказПоОстаткамНаСервере()
	
	НовыйЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСтраховойЗапас.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.ЦенаБезНДС КАК ЦенаБезНДС,
		|	ЦеныСрезПоследних.СтавкаНДС КАК СтавкаНДС,
		|	ЦеныСрезПоследних.ЦенаСНДС КАК ЦенаСНДС,
		|	РегистрСтраховойЗапас.СрокПоставки КАК СрокПоставки,
		|	РегистрСтраховойЗапас.Номенклатура.ОбъемУпаковки КАК НоменклатураОбъемУпаковки
		|ИЗ
		|	РегистрСведений.СтраховойЗапас КАК РегистрСтраховойЗапас
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, ) КАК ОстаткиТоваровОстатки
		|		ПО РегистрСтраховойЗапас.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, ) КАК ЦеныСрезПоследних
		|		ПО РегистрСтраховойЗапас.Номенклатура = ЦеныСрезПоследних.Номенклатура
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < РегистрСтраховойЗапас.СтраховойЗапас";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МаксимальнаяДатаПоставки = НачалоДня(ТекущаяДата());
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрокаТЧ = НовыйЗаказ.Позиции.Добавить();
		НоваяСтрокаТЧ.Наименование = ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяСтрокаТЧ.Количество = ВыборкаДетальныеЗаписи.НоменклатураОбъемУпаковки;
		НоваяСтрокаТЧ.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
		НоваяСтрокаТЧ.Цена = ВыборкаДетальныеЗаписи.ЦенаБезНДС;
		НоваяСтрокаТЧ.Сумма = ВыборкаДетальныеЗаписи.ЦенаБезНДС * ВыборкаДетальныеЗаписи.НоменклатураОбъемУпаковки;
		НоваяСтрокаТЧ.СуммаНДС = НДССервер.СуммаНДСПоСтавке(НоваяСтрокаТЧ.Сумма, НоваяСтрокаТЧ.СтавкаНДС); 
		НоваяСтрокаТЧ.СуммаСНДС = НоваяСтрокаТЧ.Сумма + НоваяСтрокаТЧ.СуммаНДС;
		
		//Вычислим самую крайнюю дату поставки из всех позиций с учетом сегоднящнего дня:
		ДатаПоставкиВыбраннойПозиции = НачалоДня(ТекущаяДата()) + (ВыборкаДетальныеЗаписи.СрокПоставки * 86400); 
		
		Если МаксимальнаяДатаПоставки < ДатаПоставкиВыбраннойПозиции Тогда
			
			МаксимальнаяДатаПоставки = ДатаПоставкиВыбраннойПозиции;
				
		КонецЕсли;
			
	КонецЦикла;
	
	НовыйЗаказ.Адрес = "г.Москва, ул.Б.Ордынка, д. 26";
	НовыйЗаказ.Дата = ТекущаяДата();
	НовыйЗаказ.ДатаПоставки = МаксимальнаяДатаПоставки;
	НовыйЗаказ.Комментарий = "Документ создан автоматической обработкой.";
	НовыйЗаказ.Записать();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("Создан новый %1. Проверьте количество заказываемых позиций", НовыйЗаказ);
	Сообщение.КлючДанных = НовыйЗаказ.Ссылка;
   	Сообщение.Сообщить(); 
	
	Возврат НовыйЗаказ.Ссылка;
	
КонецФункции

#КонецОбласти
